ELPasEDT/src/InformationRegisters/НастройкиПараметровАРМУчетаРеагентов/НастройкиПараметровАРМУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПараметровАРМУчетаРеагентов</name>
  <resources>
    <name>ЕдиницаИзмеренияКонцентрацииРаствора</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияПлотностиРаствора</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьКонтрольУровня</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/БазовыеЕдиницыИзмеренияРеагентов/БазовыеЕдиницыИзмеренияРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БазовыеЕдиницыИзмеренияРеагентов</name>
  <resources>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>БазоваяЕдиницаИзмеренияОбъема</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/НастройкиПараметровАРМУчетаРеагентов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ЗаполнитьБазовуюЕдиницу()
	
	Если Не ЗначениеЗаполнено(Запись.Реагент) Тогда
		БазоваяЕдиницаИзмеренияКонцентрации = Неопределено;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности
	|ИЗ
	|	РегистрСведений.БазовыеЕдиницыИзмеренияРеагентов КАК БазовыеЕдиницыИзмеренияРеагентов
	|ГДЕ
	|	БазовыеЕдиницыИзмеренияРеагентов.ВидРеагента = &ВидРеагента");
	Запрос.УстановитьПараметр("ВидРеагента", Запись.Реагент.ВидРеагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БазоваяЕдиницаИзмеренияКонцентрации = Выборка.ЕдиницаИзмеренияКонцентрации;
		БазоваяЕдиницаИзмеренияПлотности = Выборка.ЕдиницаИзмеренияПлотности;
	Иначе
		БазоваяЕдиницаИзмеренияКонцентрации = Неопределено;
		БазоваяЕдиницаИзмеренияПлотности = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьБазовуюЕдиницу();
КонецПроцедуры

&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	ЗаполнитьБазовуюЕдиницу();
КонецПроцедуры
